{
	"type": "POST",
	"name": "Elliott & Cooper",
	"tag": "Design x Development Project",
	"title": "Property management made simple.",
	"outbound": {
		"alive": false,
		"url": ""
	},
	"imageUrl": "/content/posts/elliott-cooper/img/1.png",
	"meta": {
		"splashText": "One of my first development projects saw me work together with other designers and developers to build a tool to help manage the purchase and sale of properties.",
		"role": "A design and development project. In a team of 4, I worked on the front-end design and development of the application.",
		"year": "2015",
		"technologies": [
			{
				"name": "Laravel"
			},
			{
				"name": "HTML"
			},
			{
				"name": "CSS"
			},
			{
				"name": "jQuery"
			},
			{
				"name": "Git"
			}
		]
	},
	"sections": [
		{
			"id": 0,
			"imageUrl": "./content/posts/elliott-cooper/img/1.jpg",
			"imageAuthor": "@maxconacher",
			"title": "UI + UX",
			"content": [
				"I worked with the client on a regular basis to help create their administrative property management tool. The main goal of the app was to structure and formalise the way they bought and sold property, so they could work faster and more efficiently.",
				"I started on the creation of UI designs in Photoshop based off a set of wireframes, iterating back and forth to try to improve the original ideas. I used design in browser techniques to help speed up the design process, and explore ideas faster than traditional static designs.",
				"One of the main parts of the application was a workflow system that helped the client work through a typical purchase or sale. The system let the user move through a list of pending items sequentially using a series of triggers. The UI was difficult to design correctly, as it had to ensure the user could navigate through each pending item whilst automatically prompting them of the next item. Modals were used heavily throughout the UI as they were most effective in making the user take immediate and specific actions."
			]
		},
		{
			"id": 1,
			"imageUrl": "./content/posts/elliott-cooper/img/2.jpg",
			"imageAuthor": "@alain_pham",
			"title": "Technical Architecture",
			"content": [
				"The application was created in Laravel, and so the majority of the front-end work follow the conventions of using Blade templating to product the view templates. Interactive functionality was added by way of jQuery, which proved to be quick to implement, but difficult to maintain and update."
			] 
		}
	],
	"finalThoughts": "Working on both design and development aspects of this project helped to give me a perspective on the different sides of web application projects. Looking back on the project, there were many areas that could have been improved in regards to front-end architecture, but it gave a great opportunity for learning and development. The app was successfully completed and delivered to the client who was delighted in the result.",
	"images": []
}