{
	"type": "POST",
	"name": "TFL Tube Finder",
	"tag": "Design/Development Project",
	"title": "Checking the tube status has never been better!",
	"outbound": {
		"alive": true,
		"url": "https://cswarb.github.io/underground-status"
	},
	"imageUrl": "/content/posts/tube-finder/img/1.png",
	"meta": {
		"splashText": "The TFL tube finder app was a self-initiated work. One of my goals was to use the opportunity to help me learn the new Angular 2+ framework.",
		"role": "I created the front-end, UI design, experience, and complete development including api integration",
		"year": "2017",
		"technologies": [
			{
				"name": "Angular 4"
			},
			{
				"name": "HTML"
			},
			{
				"name": "SASS"
			},
			{
				"name": "Git + Github"
			},
			{
				"name": "TFL Unified API"
			}
		]
	},
	"introduction": {
		"title": "How can checking a tube status be sublime? Responsive UI, clear application flow, and built for speed. These were the 3 key points I kept in mind when building my version of a tube checker",
		"content": ""
	},
	"sections": [
		{
			"id": 0,
			"imageUrl": "./content/posts/tube-finder/img/1.jpg",
			"imageAuthor": "@christiankaindl",
			"title": "UI + UX",
			"content": [
				"I began the project by defining exactly how a typical user would navigate through the site. This involved creating storyboards and personas to define the context in which the user would typically use the app, and help me understand how I could cater to the users needs. A key point I wanted to address early on was how users will interact with the service on the move, and from this I created 2 must have criteria: It must be responsive, It must be lightweight.",
				"At this point I debated whether or not to continue with Angular 2 as a framework. However, the AOT compile mode and lazy loading features, along with other compiling features such as tree shaking confirmed my decision."
			]
		},
		{
			"id": 1,
			"imageUrl": "./content/posts/tube-finder/img/2.jpg",
			"imageAuthor": "@romainp",
			"title": "Technical Architecture",
			"content": ["I split the app up into 3 distinct layers that would define how I would get data, and interact with it. I first created a Service layer which would contain all HTTP requests and transform the Observables to Promises. The Facade layer would handle all the business logic that needed to happen before data is returned to the component. The component layer was the final layer, and I ensured that it only interacted with the Facade layer."] 
		},
		{
			"id": 2,
			"imageUrl": "./content/posts/tube-finder/img/3.jpg",
			"imageAuthor": "@goran_ivos",
			"title": "Development",
			"content": [
				"The development was really simple to setup and maintain thanks to the use of Angular-cli, which I used to create all components and services.",
				"During the development phase, I contacted Transport for London to request access to official assets, including the Roundel and Typefaces to use on the application. However, this was rejected, and meant I could not round off the look of the app as I would have wanted. I could fortunately continue to use the TFL API to power the application."
			] 
		}
	],
	"finalThoughts": "Creating the app up to this point took a few months of my spare time, and in my opinion turned out well from a design and development perspective. It allowed me to develop my skills in Angular 2 + 4, and also develop my knowledge of component based development methodologies. If I were to do it again, I'd put more of a focus on developing more re-usable components with a better API for passing options to, to customise the look and feel — an example being the auto-complete component.",
	"images": [
		{
			"title": "Line Listing UI",
			"imageUrl": "./content/posts/tube-finder/img/1.png"
		},
		{
			"title": "Request Logs",
			"imageUrl": "./content/posts/tube-finder/img/2.png"
		},
		{
			"title": "Development Code",
			"imageUrl": "./content/posts/tube-finder/img/3.png"
		},
		{
			"title": "Autocomplete UI",
			"imageUrl": "./content/posts/tube-finder/img/4.png"
		},
		{
			"title": "Custom vectors",
			"imageUrl": "./content/posts/tube-finder/img/5.png"
		}
	]
}